{
  "EntryScene": [
    {
      "character": "旁白",
      "dialogue": "深夜，新宿車站的中央線月台。月台上的電子顯示板閃爍著午夜的班次訊息，空氣中混雜著週末狂歡後的疲憊與歸家的焦躁。人群三三兩兩，各自沉浸在自己的世界裡。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）又是一個喧鬧的夜晚……派對的酒精和笑語彷彿還在耳邊，但一轉身，就只剩下自己和這片冰冷的月台。二十八歲，不高不低，不成功也不失敗，就像這末班車一樣，卡在終點之前。"
    },
    {
      "character": "旁白",
      "dialogue": "李杰輕輕嘆了口氣，將視線投向周圍的人群。他的習慣就是觀察，從陌生人的表情和動作中猜測他們的故事，以此來排解獨處時的空虛。"
    },
    {
      "character": "旁白",
      "dialogue": "不遠處，一群朝氣蓬勃的大學生正大聲說笑，他們是月台上最鮮活的色彩。"
    },
    {
      "character": "大學生（男A）",
      "dialogue": "喂！你們說，剛剛那家店的酒也太遜了吧！下次絕對不去了！"
    },
    {
      "character": "大學生（女A）",
      "dialogue": "就是說啊！而且還那麼貴！還不如我們在便利商店買的罐裝酒好喝！"
    },
    {
      "character": "大學生（男B）",
      "dialogue": "下次去我推薦的那家啦！保證氣氛超讚！"
    },
    {
      "character": "眼鏡男",
      "dialogue": "（清了清喉嚨，刻意地靠近大學生們，用自以為帥氣的語氣插話）各位，聽你們的對話，就知道你們還很年輕。真正的好地方，可不是隨便能在網上找到的。下次有機會，我可以帶你們去一家行家才知道的店。"
    },
    {
      "character": "旁白",
      "dialogue": "幾個大學生面面相覷，只是禮貌性地點了點頭，便又自顧自地聊起來。眼鏡男有些尷尬地站在一旁，假裝在看手機。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）年輕真好……充滿了無所謂的精力。不過，那個傢伙也太刻意了，那種急於表現的樣子，反而顯得淺薄。"
    },
    {
      "character": "旁白",
      "dialogue": "李杰的目光從那群年輕人身上移開，隨意掃視著月台，然後，他的視線停住了。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）嗯？那個女孩……"
    },
    {
      "character": "旁白",
      "dialogue": "在喧鬧人群的另一端，一個女孩安靜地坐在長椅的角落。她穿著一件淺色的連衣裙，戴著耳機，身前的腿上放著一本素描本，正專注地用筆在上面畫著什麼。她周身散發著一種與環境格格不入的寧靜氣質，彷彿一道透明的屏障將她與外界的嘈雜隔絕開來。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）在這種地方還能如此專注，真是少見。她看起來……很特別。那閃亮的頭髮，小巧的側臉，有種讓人忍不住想保護的感覺。"
    },
    {
      "character": "旁白",
      "dialogue": "李杰的視線短暫地在她身上停留了幾秒，隨後又不著痕跡地移開，望向月台的柱子。柱子的陰影裡，站著一個全身黑衣的男人，他戴著連衣帽，帽簷壓得很低，讓人看不清他的臉。他一動也不動，像一座沒有生命的雕像。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）總覺得……有點違和感。算了，大概是我想多了。這座城市裡，什麼樣的人都有。"
    },
    {
      "character": "旁白",
      "dialogue": "往高尾方向的末班車即將進站，請各位乘客退到黃線後方等候。"
    },
    {
      "character": "旁白",
      "dialogue": "列車的頭燈劃破黑暗，伴隨著平穩的聲響駛入月台。冰冷的金屬車身反射著月台的燈光。車門打開，等待的人群開始緩緩移動。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）終於來了，回家吧。"
    },
    {
      "character": "旁白",
      "dialogue": "李杰隨著人流走進車廂，找了一個靠窗的空位坐下。他放下背包，不經意地一瞥，發現那個安靜的女孩也上了同一節車廂，就坐在斜前方不遠處。她依舊低著頭，專注於她的小世界。那群大學生和那個故作深沉的眼鏡男也吵吵鬧鬧地走了進來，坐在車廂的另一頭。車門關閉的提示音響起，列車緩緩開動，窗外的城市燈火開始向後倒退，漸漸變得模糊。此刻的他還無法想像，這輛將他帶離熟悉的城市的列車，將會把他帶往一個怎樣的命運。"
    }
  ],
  "TrainRideScene": [
    {
      "character": "旁白",
      "dialogue": "列車平穩地行駛著，窗外的城市燈火匯成一條條流動的光河，迅速向後退去。車廂內，除了大學生們偶爾的笑鬧聲，大部分乘客都在閉目養神或滑著手機，享受著歸家途中的片刻寧靜。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）總算能安靜一下了...這週末也真夠累的。"
    },
    {
      "character": "旁白",
      "dialogue": "就在這時，列車前方出現了隧道的入口，像一張沉默的巨口。車廂內的燈光自動亮起，窗外瞬間被純粹的黑暗吞噬，只剩下玻璃上乘客們模糊的倒影。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）啊，是那條隧道了。按照平常的經驗，大概五分鐘就能出去。正好閉目養神一下。"
    },
    {
      "character": "旁白",
      "dialogue": "李杰靠在椅背上，閉上了眼睛。列車運行的單調聲響像催眠曲一樣在耳邊迴響。一分鐘，兩分鐘...五分鐘過去了。他下意識地覺得應該要看到光了，但眼皮之外，世界依舊昏暗。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）嗯？怎麼還沒出去？...也許是今天比較累，感覺時間過得特別慢吧。"
    },
    {
      "character": "旁白",
      "dialogue": "又過了五分鐘。車廂內恆定的、嗡嗡作響的空調聲，以及列車碾過鐵軌的節奏性轟鳴，此刻不再讓人安心，反而像是一種無限循環的宣告。李杰心中的違和感越來越強烈。他睜開眼，拿出手機，想確認一下時間和路線。"
    },
    {
      "character": "旁白",
      "dialogue": "螢幕顯示現在是午夜十二點十五分。他記得列車是十一點五十五分駛離月台的，這意味著，列車已經在隧道裡行駛了將近二十分鐘。螢幕的頂端，「沒有服務」的四個字清晰地顯示著。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）二十分鐘...這絕對不正常。"
    },
    {
      "character": "旁白",
      "dialogue": "與此同時，車廂另一頭的寧靜被徹底打破了。"
    },
    {
      "character": "大學生（女A）",
      "dialogue": "不是吧？我的手機完全沒訊號！連圈外都不是，是「沒有服務」耶！這底下是多深啊？"
    },
    {
      "character": "大學生（男A）",
      "dialogue": "我的也是，什麼都傳不出去。喂，這隧道也太長了吧？以前有這麼長嗎？我怎麼一點印象都沒有？"
    },
    {
      "character": "眼鏡男",
      "dialogue": "（故作鎮定地推了推眼鏡）這是常識。隧道結構會影響信號傳播，加上深夜線路維護，為了避開施工區域而繞道，延遲個二十分鐘是很正常的，不用大驚小怪。"
    },
    {
      "character": "中年男子（慷慨大叔）",
      "dialogue": "（沉穩地開口）小兄弟，話不是這麼說。我坐這條線三十年了，從來沒有在隧道裡待超過十分鐘的。這情況不對勁。"
    },
    {
      "character": "旁白",
      "dialogue": "這位大叔的話像一顆石子投入水中，讓原本還抱有僥倖心理的乘客們，臉上最後一絲輕鬆也消失了。"
    },
    {
      "character": "中年夫婦（妻）",
      "dialogue": "（語氣焦急）老公，我有點不安...你不是說這條路你很熟嗎？這是怎麼回事？"
    },
    {
      "character": "中年夫婦（夫）",
      "dialogue": "（煩躁地）我怎麼會知道！我又不是司機！妳問我有什麼用！"
    },
    {
      "character": "小男孩",
      "dialogue": "媽媽，我怕黑...我們什麼時候才能出去？"
    },
    {
      "character": "母親",
      "dialogue": "（緊緊抱住孩子，安撫地）快了快了，寶寶乖，你看，姐姐都沒怕。別看窗外了，我們看手機裡的卡通好不好？啊...手機也..."
    },
    {
      "character": "旁白",
      "dialogue": "那位母親想打開手機影片，卻發現同樣沒有網路。"
    },
    {
      "character": "旁白",
      "dialogue": "焦慮像會傳染的病毒，迅速在車廂內蔓延。人們開始交頭接耳，竊竊私語變成了公開的抱怨和質疑，原本昏昏欲睡的氣氛被濃稠的不安與疑惑所取代。"
    },
    {
      "character": "旁白",
      "dialogue": "一片混亂中，李杰的目光下意識地再次轉向那個安靜的女孩，少女A。"
    },
    {
      "character": "旁白",
      "dialogue": "她像是身處另一個次元。周圍的騷動絲毫沒有影響到她。她沒有看手機，也沒有望向窗外，只是專注於腿上的素描本。李杰甚至能看到她的筆沒有停下，在素描本上，她畫的不是人物，而是一個由複雜螺旋和尖角構成的奇異圖騰，看起來像某種古老的符號。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）在這種時候...她還在畫畫？而且畫的是...那是什麼東西？她好像...完全不屬於這裡。"
    },
    {
      "character": "中年男子（自私膽小）",
      "dialogue": "喂！肯定出事了！是不是該去按那個緊急通話鈕啊！不然我們就在這裡困到天亮嗎？"
    },
    {
      "character": "中年男子（慷慨大叔）",
      "dialogue": "你冷靜點！現在列車還在平穩運行，亂按鈕萬一導致緊急停車，卡在隧道中間那才叫危險！"
    },
    {
      "character": "旁白",
      "dialogue": "就在兩人快要爭吵起來，車廂內的氣氛越來越凝重時，列車前方，黑暗的盡頭，終於滲出了一絲光亮。"
    },
    {
      "character": "大學生（男B）",
      "dialogue": "啊！有光了！終於要出去了！"
    },
    {
      "character": "旁白",
      "dialogue": "這一聲喜悅的呼喊像救贖一樣，讓所有人都停止了爭論，不約而同地將目光投向那片越來越大的光芒，每個人的臉上都寫滿了劫後餘生般的期待。"
    },
    {
      "character": "旁白",
      "dialogue": "但是，所有人的表情，很快就從期待變成了困惑。那光芒有些奇怪。它不是城市夜晚那種熟悉的、溫暖的橘黃色光輝，而是一種...冰冷的、深邃的藍黑色光暈，像一片沒有星辰的夜空，帶著一股萬物死寂的氣息，正沉默地等待著他們。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）...那是什麼光？那絕對不是我熟悉的世界。"
    }
  ],
  "OtherworldStationScene": [
    {
      "character": "旁白",
      "dialogue": "列車穿過了那片詭異的藍黑色光幕，車廂內的震動忽然變得極其輕微，幾乎感覺不到。刺眼的光芒褪去，一個絕對不應存在的，卻又無比真實的世界，展現在所有乘客眼前。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）這是..."
    },
    {
      "character": "旁白",
      "dialogue": "列車的左側，是彷彿能吞噬一切光線的幽深森林，每一棵樹都異常高大挺拔，枝葉茂密到連一絲月光都無法穿透，林中一片死寂。列車的右側，則是一望無際的黑色海洋，海面平靜得像一塊巨大的黑曜石，天上掛著兩輪紫色的殘月，映照著從未見過的詭異星辰。"
    },
    {
      "character": "大學生（女A）",
      "dialogue": "（聲音顫抖）這...這裡是哪裡？新宿...不是在內陸嗎？這片海...是怎麼回事？"
    },
    {
      "character": "大學生（男A）",
      "dialogue": "（貼在窗戶上，臉色發白）這不是東京...絕對不是！你們看天上的月亮！有兩個！"
    },
    {
      "character": "眼鏡男",
      "dialogue": "（結結巴巴地）一...定是某種宣傳活動...對，是利用大氣反射原理製造的海市蜃樓...一定是這樣！"
    },
    {
      "character": "中年夫婦（夫）",
      "dialogue": "（對著眼鏡男怒吼）你還在胡說八道什麼！你家投影能連空氣的味道都改變嗎！快報警啊！誰的手機有訊號？！"
    },
    {
      "character": "旁白",
      "dialogue": "「失聯」這兩個字像一把重錘，敲碎了所有人最後的僥倖。恐慌與絕望的情緒徹底爆發，尖叫聲、哭泣聲、祈禱聲在車廂內交織成一片混亂的交響樂。"
    },
    {
      "character": "旁白",
      "dialogue": "李杰看到少女A縮在自己的座位上，身體因為恐懼而微微顫抖。她手中的素描本滑落在地，雙手緊緊抓著自己的手臂，臉色蒼白如紙，雙眼圓睜，死死地盯著窗外那片死寂的黑色海洋，彷彿看見了什麼極其恐怖的東西。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）她看起來...比任何人都還要害怕。"
    },
    {
      "character": "旁白",
      "dialogue": "就在眾人陷入極度恐慌之際，列車的速度以一種不可思議的平穩度開始放緩。在前方不遠處的海岸線上，出現了一座孤零零的車站。"
    },
    {
      "character": "中年男子（慷慨大叔）",
      "dialogue": "前面有車站！大家看！有車站！"
    },
    {
      "character": "旁白",
      "dialogue": "這句話讓混亂的車廂暫時安靜下來。列車緩緩駛入，最終完美地停靠在月台旁。月台上，一塊被海風嚴重侵蝕的站牌上，用一種他們從未見過的古老字體寫著兩個字——「寂海」。"
    },
    {
      "character": "旁白",
      "dialogue": "車廂內，所有人都屏住了呼吸，等待著廣播。但是，只有死一樣的寂靜。"
    },
    {
      "character": "旁白",
      "dialogue": "在令人窒息的沉默中，車門發出「嘶」的一聲輕響，緩緩向兩側滑開。一股帶著濃郁鹹味和陌生草木氣息的冰冷空氣，從外面灌了進來。"
    },
    {
      "character": "旁白",
      "dialogue": "沒有人動。剛才還在哭喊的乘客，此刻都像被扼住了喉嚨，恐懼地望著那敞開的車門，以及門外那深不見底、彷彿能吞噬靈魂的黑暗。"
    },
    {
      "character": "李杰",
      "dialogue": "（內心）留下，是待在這失控的鐵盒裡；出去，是踏入一個無法理解的世界...我們...到底該怎麼辦？"
    }
  ]
}
