{
  "EntryScene": [
    {
      "character": "旁白",
      "dialogue": "月台上的夜風有些涼，但和周遭的喧囂相比，這點涼意微不足道。這裡是新宿車站，凌晨一點，末班列車前的最後喧嘩。人們急匆匆地穿梭，腳步聲、交談聲、列車廣播聲，混雜成一首屬於大都市午夜的交響樂。李杰站在人群之中，像個局外人。他緊了緊夾克，試圖驅散身上殘留的酒氣和疲憊。他是個建築師，二十八歲，生活就像他的作品一樣，精確、嚴謹，卻也帶著難以言喻的單調。剛才的派對還在腦海中迴盪，那些喧鬧、笑聲和五光十色的光影，都與他此刻的孤獨形成了鮮明對比。"
    },
    {
      "character": "旁白",
      "dialogue": "他低頭看了一眼手機，時間顯示為凌晨一點十分。他習慣性地抬起頭，掃視著周圍。車站月台上的燈光依舊明亮，但已少了白日的生機。幾名醉醺醺的上班族相互攙扶，大聲嚷嚷著；一對年輕情侶在角落依依不捨地告別；還有一個學生模樣的女孩，獨自坐在長椅上，背靠著一個巨大的旅行背包，安靜地等待著。"
    },
    {
      "character": "旁白",
      "dialogue": "李杰的目光落在了那個女孩身上。她看起來只有二十出頭，穿著一件簡單的白色T恤，長髮披散在肩上。她的臉龐在明亮的燈光下顯得有些稚氣，但眼神卻充滿了好奇。她並沒有和其他人一樣急著趕路，而是從背包裡拿出一個小本子，用筆在上面寫寫畫畫。"
    },
    {
      "character": "旁白",
      "dialogue": "李杰感到好奇，忍不住多看了幾眼。他注意到她畫的並不是什麼風景，而是一些奇異的符號，像古老的文字，又像某種複雜的電路圖。就在他思索之際，遠處傳來了火車的汽笛聲。一束強光從黑暗中劃破夜空，列車轟隆隆地駛進月台。"
    },
    {
      "character": "旁白",
      "dialogue": "他收回目光，隨著人群踏上車廂，找了個靠窗的座位坐下。剛才那個女孩也走了進來，在他對面不遠處的空位坐下。"
    },
    {
      "character": "旁白",
      "dialogue": "列車緩緩啟動，將新宿車站的燈火輝煌甩在身後，駛向那片無邊的黑暗。這趟列車，將帶他回到家，回到那個他熟悉而單調的世界。李杰閉上眼睛，試圖讓疲憊的身體休息，卻不知道，這趟旅程的終點，遠比他所想的要複雜得多。"
    }
  ],
  "TrainRideScene": [
    {
      "character": "旁白",
      "dialogue": "列車行駛得很平穩，車廂裡除了空調的嗡嗡聲，就只剩下零星的低語。李杰靠著窗戶，看著城市的光影在窗外飛速倒退。他掏出手機，正準備隨便刷刷社交媒體。"
    },
    {
      "character": "李杰",
      "dialogue": "（心理獨白）這趟車總算是要結束了，回去洗個澡，好好睡一覺..."
    },
    {
      "character": "旁白",
      "dialogue": "列車駛入了城郊那條著名的「漫長隧道」。車窗外瞬間陷入一片伸手不見五指的黑暗，只有車廂內的燈光映照著每個人的臉龐。隧道內，列車的運轉聲音似乎比平常更沉悶，但也僅此而已，並沒有任何故障的跡象。李杰正刷著一個網頁，頁面卻突然卡住，轉動的讀取圖示最終變成了「無法載入」的錯誤提示。他皺了皺眉，試著刷新，但無論如何都無法連接網路。"
    },
    {
      "character": "李杰",
      "dialogue": "（心理獨白）怎麼回事？這條隧道我搭過這麼多次，手機訊號從來沒斷得這麼徹底。"
    },
    {
      "character": "旁白",
      "dialogue": "他抬頭看了一眼，發現車廂裡不少人都面露疑惑地擺弄著手機，顯然也遇到了同樣的問題。"
    },
    { "character": "王工", "dialogue": "奇怪，怎麼一點訊號都沒有？" },
    { "character": "小陳", "dialogue": "我手機也連不上網了，是不是基地台出問題了？" },
    { "character": "小趙", "dialogue": "不可能啊，我們才剛進隧道，就算收不到訊號，也不會連Wi-Fi都斷吧？" },
    {
      "character": "旁白",
      "dialogue": "列車依舊平穩地向前行駛著，車速也沒有絲毫減緩，但隧道卻漫長得超乎尋常。李杰看了看手錶，感覺已經遠遠超過了這條隧道正常的行駛時間。這種感覺讓他感到一絲不安。"
    },
    {
      "character": "李杰",
      "dialogue": "（心理獨白）我記得搭這趟車好幾年了，從沒見過這隧道走這麼久。"
    },
    {
      "character": "旁白",
      "dialogue": "他瞥了一眼對面的林雅，女孩依然專注地看著手中的小本子，臉上沒有絲毫焦慮，彷彿完全不受列車狀況的影響。這份異常的冷靜讓李杰感到更加奇怪。"
    },
    { "character": "王工", "dialogue": "怎麼回事？這都快三十分鐘了，怎麼還在隧道裡？這不科學！" },
    {
      "character": "老張",
      "dialogue": "（揉了揉惺忪的睡眼）啊？還沒到嗎？我以為我睡過站了呢。"
    },
    { "character": "小陳", "dialogue": "不對勁，絕對不對勁！這隧道根本沒這麼長！" },
    {
      "character": "旁白",
      "dialogue": "車廂內的氣氛變得愈發壓抑，乘客們開始竊竊私語，甚至有人站起來不安地在車廂內走動。李杰緊握著手錶，看著秒針一圈圈轉動，心中充滿了疑惑和不安。列車始終平穩地運行著，沒有任何異常的震動或聲音，但正是這種「正常」與超長隧道的反差，讓恐懼悄悄滋生。"
    },
    {
      "character": "李杰",
      "dialogue": "（心理獨白）這種感覺...就像是這輛車載著我們，駛入了一個不該存在的時間與空間。"
    },
    {
      "character": "旁白",
      "dialogue": "就在這時，隧道盡頭終於出現了光亮。所有人都屏住了呼吸，期待著能看到熟悉的城市夜景。李杰也鬆了一口氣，以為一切即將回歸正常。但當列車平穩地駛出隧道的瞬間，他卻僵住了。"
    }
  ],
  "OtherworldStationScene": [
    {
      "character": "旁白",
      "dialogue": "列車猛地一震，隨後發出刺耳的摩擦聲。隧道盡頭的光亮越來越強，所有人都屏住了呼吸，期待著能看到熟悉的城市夜景。李杰也鬆了一口氣，以為一切即將回歸正常。但當列車平穩地駛出隧道的瞬間，他卻僵住了。"
    },
    { "character": "李杰", "dialogue": "（心理獨白）這……這怎麼可能？" },
    {
      "character": "旁白",
      "dialogue": "映入眼簾的，不是熟悉的城市燈火，而是一個寧靜得令人毛骨悚然的世界。列車正沿著一條懸崖邊的鐵軌行駛，左側是無邊無際的幽暗森林，樹影幢幢，彷彿潛藏著無數雙眼睛；右側則是深不見底的懸崖，懸崖下是平靜如鏡的漆黑海洋。天空中沒有月亮，也沒有星星，只有一片深邃的藍黑色，靜謐得彷彿能吞噬所有光線。"
    },
    {
      "character": "旁白",
      "dialogue": "車廂裡的所有人都被眼前的景象震懾住了，安靜得連一根針掉在地上的聲音都能聽見。每個人的臉上都寫滿了困惑與恐懼。"
    },
    {
      "character": "王工",
      "dialogue": "（瞪大眼睛，聲音顫抖）這…這不是我們來的方向……這到底是什麼地方？"
    },
    {
      "character": "老張",
      "dialogue": "（酒意全消，臉色慘白）這、這是哪裡？我、我得回去！"
    },
    {
      "character": "小陳",
      "dialogue": "（聲音發抖）怎麼會有這種地方？我們……我們是不是在做夢？"
    },
    {
      "character": "旁白",
      "dialogue": "李杰轉頭看向林雅，發現她也同樣被窗外的景象所吸引，但她的眼神中，除了驚訝，還帶著一絲難以察覺的好奇。她緊握著手中的小本子，彷彿那是她唯一的依靠。"
    },
    {
      "character": "旁白",
      "dialogue": "列車持續向前行駛，最終在一座名為「靜默之海」的神秘車站前緩緩停下。這座車站異常簡潔，沒有招牌，沒有任何廣告，只有一盞孤零零的燈光在月台上搖曳。"
    },
    {
      "character": "旁白",
      "dialogue": "列車平穩地停靠，隨後，車門無聲無息地向兩邊滑開。沒有廣播，沒有任何指示，只有一股冰冷的、帶著海鹽氣息的空氣湧入車廂。"
    },
    {
      "character": "旁白",
      "dialogue": "所有人都僵坐在座位上，無人敢動。恐懼像潮水般席捲了整個車廂，他們望向列車門口，彷彿門外是一隻隨時準備吞噬他們的巨獸。"
    },
    {
      "character": "李杰",
      "dialogue": "（心理獨白）我們被困在這裡了……這輛列車，它不再屬於我們熟悉的世界。接下來會發生什麼？我們該下車嗎？還是留在這裡等死？"
    },
    {
      "character": "旁白",
      "dialogue": "李杰看向身邊的乘客，每個人的眼神中都充滿了茫然與無助。在這片被遺忘的土地上，他們只能等待著，等待一個未知的命運。"
    }
  ]
}
