{
  "EntryScene": [
    {
      "character": "Narrator",
      "dialogue": "The night wind on the platform is cool, but compared to the surrounding commotion, it's barely noticeable. This is Shinjuku Station at 1:00 a.m., the final burst of noise before the last train. People hurry past, footsteps, chatter, PA announcements weaving into a symphony of the metropolis at midnight. Li Jie stands among them like an outsider. He tightens his jacket, trying to dispel lingering alcohol and fatigue. An architect at twenty-eight, his life is as precise and meticulous as his projects—yet burdened with an ineffable monotony. Memories of the party still echo in his mind: the clamor, the laughter, the flashing lights—all stark against his present solitude."
    },
    {
      "character": "Narrator",
      "dialogue": "He checks his phone: 1:10 a.m. by habit he looks around. The platform lights are still bright, though lacking the vibrancy of daytime. A few tipsy office workers prop each other up, shouting; a young couple says a lingering goodbye; and a student-looking girl sits alone on a bench, leaning against a huge backpack, quietly waiting."
    },
    {
      "character": "Narrator",
      "dialogue": "Li Jie's gaze settles on the girl. Early twenties, simple white T-shirt, long hair cascading over her shoulders. Her face looks youthful under the lights, yet curiosity gleams in her eyes. Instead of rushing like everyone else, she pulls a small notebook from her bag and begins to write and sketch."
    },
    {
      "character": "Narrator",
      "dialogue": "Intrigued, Li Jie can't help watching. She isn't drawing scenery but strange symbols—like ancient script crossed with intricate circuitry. As he wonders, a distant whistle blows. A beam of light slices through the night, and the train thunders into the platform."
    },
    {
      "character": "Narrator",
      "dialogue": "He breaks his stare, boards with the crowd, and finds a window seat. The girl from before steps in too, sitting not far across from him."
    },
    {
      "character": "Narrator",
      "dialogue": "The train eases out, leaving Shinjuku's bright lights behind and plunging into limitless darkness. It'll take him home, back to the world he knows so well—and its monotony. Li Jie closes his eyes to rest, unaware that this journey's destination is far more complicated than he imagines."
    }
  ],
  "TrainRideScene": [
    {
      "character": "Narrator",
      "dialogue": "The train glides smoothly, nothing but the air conditioner's hum and scattered whispers in the car. Li Jie leans against the window, watching city lights flicker backward. He pulls out his phone, ready to mindlessly scroll through social media."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) Almost home. Shower, bed, finally..."
    },
    {
      "character": "Narrator",
      "dialogue": "The train slips into the suburban “Endless Tunnel.” Outside the windows, darkness swallows everything; only the car's interior lights paint each face. The rumble sounds heavier than usual, but that's it—no sign of a malfunction. Li Jie browses a site, only for the page to freeze. The spinning loader becomes an error: “Unable to load.” He frowns, refreshes, but the network refuses to return."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) Seriously? I've ridden this line for years. The signal has never died like this."
    },
    {
      "character": "Narrator",
      "dialogue": "He looks up. Around the car, people poke at their phones with the same puzzled expressions."
    },
    { "character": "Worker Wang", "dialogue": "Weird. Zero bars?" },
    { "character": "Chen", "dialogue": "Mine's dead too. Did a cell tower go down?" },
    { "character": "Zhao", "dialogue": "No way. We just entered the tunnel. Even if we lost signal, the Wi-Fi shouldn't crap out." },
    {
      "character": "Narrator",
      "dialogue": "The train keeps a steady pace, but the tunnel stretches on far longer than normal. Li Jie checks his watch; it's well past the usual travel time. A murmur of unease settles in his stomach."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) I've taken this commute for years. This tunnel has never lasted this long."
    },
    {
      "character": "Narrator",
      "dialogue": "He glances at Lin Ya across the aisle. She's still focused on her little notebook, utterly calm—as if the odd situation doesn't touch her. That composure only deepens Li Jie's unease."
    },
    { "character": "Worker Wang", "dialogue": "What's going on? It's been almost thirty minutes and we're still in here! That's impossible!" },
    {
      "character": "Old Zhang",
      "dialogue": "(rubbing sleepy eyes) Huh? We're not there yet? Thought I'd slept past my stop."
    },
    { "character": "Chen", "dialogue": "Something's off—way off! This tunnel isn't this long!" },
    {
      "character": "Narrator",
      "dialogue": "The atmosphere grows denser. Passengers whisper. Some stand, pacing nervously. Li Jie clenches his watch, tracking the seconds spinning by, confusion curdling into dread. The train remains perfectly smooth, no jolts, no odd noises—but that very normalcy, paired with the endless tunnel, feeds an invisible fear."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) It feels like this train has slipped into a time and place that shouldn't exist."
    },
    {
      "character": "Narrator",
      "dialogue": "At last, light flares at the tunnel's end. Everyone holds their breath, expecting the familiar city nightscape. Li Jie exhales in relief, certain things will reset. But as the train glides out, he goes rigid."
    }
  ],
  "OtherworldStationScene": [
    { "character": "Narrator", "dialogue": "Another jolt. A scream of metal. Then blinding light. Outside is no familiar cityscape, but a grotesque world. The train stops at a station no one has seen before: on one side a twisted black forest, on the other a bottomless cliff and a blood-red sea." },
    { "character": "Lin Ya", "dialogue": "(gripping Li Jie's hand, voice trembling) Li Jie... what is this place?" },
    { "character": "Li Jie", "dialogue": "(murmurs) I don't know... this isn't my home..." },
    { "character": "Narrator", "dialogue": "The sky is a terrifying crimson. A bleeding red sun hangs at the horizon." },
    { "character": "PA", "dialogue": "(hoarse, distorted) Dear passengers... due to a system failure, we have arrived at the terminus early. All passengers... please disembark immediately." },
    { "character": "Worker Wang", "dialogue": "Terminus? Are you kidding me? What is this place?!" },
    { "character": "Old Zhang", "dialogue": "I... I have to go home... my wife is waiting..." },
    { "character": "Chen", "dialogue": "(whispers to Zhao) Could this be some kind of prank show?" },
    { "character": "Zhao", "dialogue": "(shakes head) Doesn't look like it. This is too strange..." },
    { "character": "Narrator", "dialogue": "The doors slide open. A cold wind rushes in, laced with the smell of rust." },
    { "character": "Lin Ya", "dialogue": "(hand icy in Li Jie's) I'm scared..." },
    { "character": "Li Jie", "dialogue": "(deep breath) Listen. I'll go take a look. You stay here. Don't move." },
    { "character": "Lin Ya", "dialogue": "No! Please—don't leave me alone!" },
    { "character": "Li Jie", "dialogue": "(meets her eyes, softly) Okay. We'll go together." },
    { "character": "Narrator", "dialogue": "Hand in hand, they step onto the platform. The air is colder. The platform is rough gray rock—lifeless." },
    { "character": "Li Jie", "dialogue": "No staff. No trains... not even wind." },
    { "character": "Worker Wang", "dialogue": "Look! The tracks... the tracks are gone!" },
    { "character": "Narrator", "dialogue": "Passengers spill out, faces pale with fear." },
    { "character": "Chen", "dialogue": "Is this... really the real world?" },
    { "character": "Narrator", "dialogue": "A low sound comes from the forest. Like stones grinding." },
    { "character": "Worker Wang", "dialogue": "(points at the trees) What is that?!" },
    { "character": "Narrator", "dialogue": "A black humanoid shape forms from swarms of tiny insects and emerges from the trees, moving toward them." },
    { "character": "Old Zhang", "dialogue": "Oh my god..." },
    { "character": "Narrator", "dialogue": "It suddenly accelerates." },
    { "character": "Worker Wang", "dialogue": "Run! Run!" },
    { "character": "Narrator", "dialogue": "Old Zhang is too slow. The shadow engulfs him. A short, sharp scream." },
    { "character": "Lin Ya", "dialogue": "Li Jie, run!" },
    { "character": "Narrator", "dialogue": "People scramble back into the cars. The shadow splits into countless swarms; one hurtles toward Li Jie and Lin Ya. Li Jie shields her and squeezes his eyes shut. The expected pain never comes. Lin Ya flings out her arm; a surge of force knocks him to the ground." },
    { "character": "Li Jie", "dialogue": "You... how did you..." },
    { "character": "Narrator", "dialogue": "Blue light flashes in Lin Ya's hand, forming a translucent barrier that blocks the insects." },
    { "character": "Lin Ya", "dialogue": "(pale, panting) No time to explain—go!" },
    { "character": "Narrator", "dialogue": "She pulls him. They run." },
    { "character": "Li Jie", "dialogue": "Where are we going?!" },
    { "character": "Lin Ya", "dialogue": "(silent, dragging him toward the dark forest)" },
    { "character": "Narrator", "dialogue": "He glances back. The swarm fuses again with a furious growl. Under the blood-red sky, their silhouettes vanish into the black woods." }
  ]
}
