{
  "EntryScene": [
    {
      "character": "Narrator",
      "dialogue": "The night wind on the platform is cool, but compared to the surrounding commotion, it's barely noticeable. This is Shinjuku Station at 1:00 a.m., the final burst of noise before the last train. People hurry past, footsteps, chatter, PA announcements weaving into a symphony of the metropolis at midnight. Li Jie stands among them like an outsider. He tightens his jacket, trying to dispel lingering alcohol and fatigue. An architect at twenty-eight, his life is as precise and meticulous as his projects—yet burdened with an ineffable monotony. Memories of the party still echo in his mind: the clamor, the laughter, the flashing lights—all stark against his present solitude."
    },
    {
      "character": "Narrator",
      "dialogue": "He checks his phone: 1:10 a.m. by habit he looks around. The platform lights are still bright, though lacking the vibrancy of daytime. A few tipsy office workers prop each other up, shouting; a young couple says a lingering goodbye; and a student-looking girl sits alone on a bench, leaning against a huge backpack, quietly waiting."
    },
    {
      "character": "Narrator",
      "dialogue": "Li Jie's gaze settles on the girl. Early twenties, simple white T-shirt, long hair cascading over her shoulders. Her face looks youthful under the lights, yet curiosity gleams in her eyes. Instead of rushing like everyone else, she pulls a small notebook from her bag and begins to write and sketch."
    },
    {
      "character": "Narrator",
      "dialogue": "Intrigued, Li Jie can't help watching. She isn't drawing scenery but strange symbols—like ancient script crossed with intricate circuitry. As he wonders, a distant whistle blows. A beam of light slices through the night, and the train thunders into the platform."
    },
    {
      "character": "Narrator",
      "dialogue": "He breaks his stare, boards with the crowd, and finds a window seat. The girl from before steps in too, sitting not far across from him."
    },
    {
      "character": "Narrator",
      "dialogue": "The train eases out, leaving Shinjuku's bright lights behind and plunging into limitless darkness. It'll take him home, back to the world he knows so well—and its monotony. Li Jie closes his eyes to rest, unaware that this journey's destination is far more complicated than he imagines."
    }
  ],
  "TrainRideScene": [
    {
      "character": "Narrator",
      "dialogue": "The train glides smoothly, nothing but the air conditioner's hum and scattered whispers in the car. Li Jie leans against the window, watching city lights flicker backward. He pulls out his phone, ready to mindlessly scroll through social media."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) Almost home. Shower, bed, finally..."
    },
    {
      "character": "Narrator",
      "dialogue": "The train slips into the suburban “Endless Tunnel.” Outside the windows, darkness swallows everything; only the car's interior lights paint each face. The rumble sounds heavier than usual, but that's it—no sign of a malfunction. Li Jie browses a site, only for the page to freeze. The spinning loader becomes an error: “Unable to load.” He frowns, refreshes, but the network refuses to return."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) Seriously? I've ridden this line for years. The signal has never died like this."
    },
    {
      "character": "Narrator",
      "dialogue": "He looks up. Around the car, people poke at their phones with the same puzzled expressions."
    },
    { "character": "Worker Wang", "dialogue": "Weird. Zero bars?" },
    { "character": "Chen", "dialogue": "Mine's dead too. Did a cell tower go down?" },
    { "character": "Zhao", "dialogue": "No way. We just entered the tunnel. Even if we lost signal, the Wi-Fi shouldn't crap out." },
    {
      "character": "Narrator",
      "dialogue": "The train keeps a steady pace, but the tunnel stretches on far longer than normal. Li Jie checks his watch; it's well past the usual travel time. A murmur of unease settles in his stomach."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) I've taken this commute for years. This tunnel has never lasted this long."
    },
    {
      "character": "Narrator",
      "dialogue": "He glances at Lin Ya across the aisle. She's still focused on her little notebook, utterly calm—as if the odd situation doesn't touch her. That composure only deepens Li Jie's unease."
    },
    { "character": "Worker Wang", "dialogue": "What's going on? It's been almost thirty minutes and we're still in here! That's impossible!" },
    {
      "character": "Old Zhang",
      "dialogue": "(rubbing sleepy eyes) Huh? We're not there yet? Thought I'd slept past my stop."
    },
    { "character": "Chen", "dialogue": "Something's off—way off! This tunnel isn't this long!" },
    {
      "character": "Narrator",
      "dialogue": "The atmosphere grows denser. Passengers whisper. Some stand, pacing nervously. Li Jie clenches his watch, tracking the seconds spinning by, confusion curdling into dread. The train remains perfectly smooth, no jolts, no odd noises—but that very normalcy, paired with the endless tunnel, feeds an invisible fear."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) It feels like this train has slipped into a time and place that shouldn't exist."
    },
    {
      "character": "Narrator",
      "dialogue": "At last, light flares at the tunnel's end. Everyone holds their breath, expecting the familiar city nightscape. Li Jie exhales in relief, certain things will reset. But as the train glides out, he goes rigid."
    }
  ],
  "OtherworldStationScene": [
    {
      "character": "Narrator",
      "dialogue": "The train jolts hard, metal screaming as brakes bite. Light swells at the tunnel's end. Everyone holds their breath, bracing for familiar city lights. Li Jie exhales, certain normalcy is seconds away—until the train slides out and he freezes."
    },
    { "character": "Li Jie", "dialogue": "(inner monologue) This... this can't be real." },
    {
      "character": "Narrator",
      "dialogue": "No city. Instead, a world of unnerving calm. The train clings to tracks along a cliff. On the left, an endless shadowed forest—branches looming like hidden eyes. On the right, a sheer drop into a mirror-black sea. Above, no moon, no stars—just a deep indigo sky that seems to swallow every glimmer of light."
    },
    {
      "character": "Narrator",
      "dialogue": "The entire car falls silent. You could hear a pin drop. Terror and confusion etch every face."
    },
    {
      "character": "Worker Wang",
      "dialogue": "(eyes wide, voice shaking) This... this isn't the way we came. What even is this place?"
    },
    {
      "character": "Old Zhang",
      "dialogue": "(suddenly sober, face drained) Where are we? I... I have to go back!"
    },
    {
      "character": "Chen",
      "dialogue": "(voice quivering) Places like this don't exist. Are we... are we dreaming?"
    },
    {
      "character": "Narrator",
      "dialogue": "Li Jie looks at Lin Ya. Her gaze is fixed on the window too—astonished, yes, but with a flicker of curiosity. She grips her notebook like it's the only anchor she has."
    },
    {
      "character": "Narrator",
      "dialogue": "The train keeps rolling until it slows before a station marked only by silence. \"Sea of Silence,\" the words etch themselves into Li Jie's mind though no sign announces it. No ads, no bustle. Just a single lamp swaying on the platform."
    },
    {
      "character": "Narrator",
      "dialogue": "The cars ease to a stop. Doors slide open without a sound. No announcement. No instructions. Only a rush of frigid air tinged with sea salt spilling into the aisle."
    },
    {
      "character": "Narrator",
      "dialogue": "Nobody moves. Fear sweeps the carriage like a tide. Every eye locks on the open doorway as though some waiting beast lurks just beyond."
    },
    {
      "character": "Li Jie",
      "dialogue": "(inner monologue) We're trapped. This train... it doesn't belong to our world anymore. What happens next? Do we step out... or stay and wait for the end?"
    },
    {
      "character": "Narrator",
      "dialogue": "Li Jie scans the passengers. Blank stares. Helplessness. In this forgotten place, all they can do is wait—for a fate none of them can see."
    }
  ]
}
